Autodesk.Revit.Utility.AssetPropertyDistance.DisplayUnitType
The unit type of the property

Autodesk.Revit.Utility.AssetPropertyDistance.Value
The value of the property

Autodesk.Revit.Utility.AssetPropertyDistance
Represents a property of distance value.
Remarks:
It holds a double value.
The unit varies.